{
  "roles": [
    {
      "slug": "casters",
      "name": "Caster DPS",
      "description": "Casters specialize in dealing magic damage primarily at range, using a mix of instant and casted spells to maximize damage and uptime while managing job movement restrictions amid fight mechanics. The role is highly flexible due to vastly different job mechanics and playstyles, and features a large range between pure DPS and various levels of utility.",
      "color": "#f15c5c",
      "jobs": [
        {
          "name": "Black Mage",
          "slug": "black-mage"
        },
        {
          "name": "Red Mage",
          "slug": "red-mage"
        },
        {
          "name": "Summoner",
          "slug": "summoner"
        },
        {
          "name": "Pictomancer",
          "slug": "pictomancer"
        }
      ]
    },
    {
      "slug": "healers",
      "name": "Healers",
      "description": "Healers use a variety of restorative and defensive actions to ensure that the party is always prepared to survive what comes next. They can bring the party back from the brink of disaster, or better yet, prevent disaster from striking in the first place. Healers manage their time, resources, and cooldowns to erase their enemies' efforts and their allies' mistakes alike, all while dishing out damage of their own.",
      "color": "#61ce7e",
      "jobs": [
        {
          "name": "White Mage",
          "slug": "white-mage"
        },
        {
          "name": "Scholar",
          "slug": "scholar"
        },
        {
          "name": "Astrologian",
          "slug": "astrologian"
        },
        {
          "name": "Sage",
          "slug": "sage"
        }
      ]
    },
    {
      "slug": "melee",
      "name": "Melee DPS",
      "description": "Melee DPS are close-range attackers, focused on combos and careful positioning to inflict the maximum amount of damage while dancing around the enemy's hitbox and trying to not disengage as much as possible.",
      "color": "#f15c5c",
      "jobs": [
        {
          "name": "Monk",
          "slug": "monk"
        },
        {
          "name": "Dragoon",
          "slug": "dragoon"
        },
        {
          "name": "Ninja",
          "slug": "ninja"
        },
        {
          "name": "Samurai",
          "slug": "samurai"
        },
        {
          "name": "Reaper",
          "slug": "reaper"
        },
        {
          "name": "Viper",
          "slug": "viper"
        }
      ]
    },
    {
      "slug": "ranged",
      "name": "Ranged DPS",
      "description": "With high party utility and unparalleled mobility, Physical Ranged jobs are masters of adjusting to suit the needs of the encounter at hand. Each Ranged job comes equipped with a party-wide 10% damage mitigation and a robust CC toolkit to keep their allies safe. With no cast bars or positional requirements, Ranged players can zoom around the battlefield and still dish out serious damage.",
      "color": "#f15c5c",
      "jobs": [
        {
          "name": "Bard",
          "slug": "bard"
        },
        {
          "name": "Machinist",
          "slug": "machinist"
        },
        {
          "name": "Dancer",
          "slug": "dancer"
        }
      ]
    },
    {
      "slug": "tanks",
      "name": "Tanks",
      "description": "Tasked with holding the attention of the enemies, Tanks are the role that manages enemy positioning and takes a majority of the damage in a given encounter. Each tank comes equipped with both personal and party mitigation tools, as well as a damage toolkit unique to each specific job.",
      "color": "#4d8be6",
      "jobs": [
        {
          "name": "Paladin",
          "slug": "paladin"
        },
        {
          "name": "Warrior",
          "slug": "warrior"
        },
        {
          "name": "Dark Knight",
          "slug": "dark-knight"
        },
        {
          "name": "Gunbreaker",
          "slug": "gunbreaker"
        }
      ]
    }
  ]
}
